export const BACKGROUND = ["/bg1.jpg", "/bg2.jpg", "/bg3.jpg", "/bg4.jpg"];

export const TRAVELS = [
  {
    name: "اسطنبول",
    image: "/istanbul.png",
    description: "5 أيام بتكلفة 1,500 دولار",
  },
  {
    name: "دبي",
    image: "/dubai.png",
    description: "3 أيام بتكلفة 2,500 دولار",
  },
  {
    name: "القاهرة",
    image: "/cairo.png",
    description: "3 أيام بتكلفة 1,250 دولار",
  },
  {
    name: "الرياض",
    image: "/riyadh.png",
    description: "2 أيام بتكلفة 1,500 دولار",
  },
];

export const SERVICES = [
  {
    name: "دليل سياحي",
    description: "نقدم لك خدمات الإرشاح السياحي لبناء خطط سفر مميزة.",
    image: "/service1.png",
  },
  {
    name: "حجوزات فندقية",
    description: "لا تقلق حول مكان إقامتك فنحن نهتم بكامل الحجوزات الخاصة بنا.",
    image: "/service2.png",
  },
  {
    name: "رحلات ميدانية",
    description:
      "لن تكون إجازتك مملة معنا فهناك الكثير من الخطط و الرحلات المختلفة.",
    image: "/service3.png",
  },
];

export const PLANS = [
  {
    name: "خطة الاقتصادية",
    price: 260,
    description:
      "نقدم لك إمكانية زيارة بلدان العالم بأقل التكاليف الممكنة وبأفضل الخدمات",
    features: [
      "بطاقات سفر في الدرجة الاقتصادية",
      "حجز بفندق ثلاث نجوم",
      "وجبات إفطار يومية",
    ],
  },
  {
    name: "خطة عائلية",
    price: 520,
    description: "هذه الخطوة مناسبة جداً إن كنت ترغب في قضاء إجازتك مع العائلة",
    features: [
      "بطاقات سفر في الدرجة أولى",
      "حجز بفندق أربع نجوم",
      "رحلات ميدانية بشكل يومي",
    ],
  },
  {
    name: "خطة رجال الأعمال",
    price: 850,
    description: "كونك شخص ذو ذوق خاص ستكون هذه الخطة هي ما يناسبك تماماً",
    features: [
      "بطاقات سفر بدرجة رجال الأعمال",
      "حجز بفندق خمس نجوم",
      "متابعة خاصة لإحتياجاتك",
    ],
  },
];

export const REVIEWS = [
  {
    user: "محمد الأحمد",
    image: "/user1.png",
    comment:
      "كانت تجربة مميزة مع خدمات رائعة قضيت أفضل إجازة لي من فترة طويلة، أنصح بالتعامل مع شركة رحلاتي بدون تردد.",
  },
  {
    user: "ماهر عبد اللطيف",
    image: "/user2.png",
    comment:
      "تقدم شركة رحلاتي خدمات مناسبة جداً لرجال الأعمال، هذا ما ساعدني في رحلتي وجعلني اختصر جدا من مشاكل الحجوزات.",
  },
  {
    user: "أسامة الأبيض",
    image: "/user3.png",
    comment:
      "يمكنني القول إنني قمت بقطاء أفضل رحلة عائلة على الإطلاق، كان الفنادق رائعة وخطة السفر ممتازة جدا ومريحة.",
  },
];

export const CONTACT = [
  {
    name: "نقدم لك المساعدة",
    image: "/help.png",
    description:
      "إن كان لديك اي مشكلة في البلد الذي تسافر إليه سنقوم بمساعدك في هذا الموضوع.",
  },
  {
    name: "للتواصل",
    image: "/communication.png",
    description:
      "يمكنك التواصل معنا عبر الفورم أو عبر البريد الإلكتروني: company@mail.com",
  },
  {
    name: "أوقات الدوام",
    image: "/working.png",
    description:
      "يمكنك التواصل معنا يومياً أثناء أوقات الدوام من الساعة 9 صباحاً حتى 6 مساء.",
  },
];

export const FOOTER = [
  { title: "حول", links: ["الشركة", "من نحن؟", "فرص العمل", "المدونة"] },
  {
    title: "خدماتنا",
    links: [
      "بطاقات الطيران",
      "الرحلات البحرية",
      "الفنادق",
      "الرحلات البرية",
      "تأمين الفيزا",
    ],
  },
  {
    title: "الحجوزات",
    links: ["العروض الجديدة", "تأكد من حجزك", "الاشتراكات", "طرق السفر"],
  },
  {
    title: "الموقع",
    links: ["سياسة الخصوصية", "شروط الاستخدام", "بلغ عن مشكلة", "تواصل معنا"],
  },
];
